export default {
  A: [
    {
      id: "A",
      name: "安徽",
      data: ["合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "阜阳", "安庆"],
    },
  ],
  B: [
    {
      id: "B",
      name: "北京",
      data: ["北京", "天津", "石家庄", "唐山", "保定", "张家口", "承德"],
    },
  ],
  C: [
    {
      id: "C",
      name: "重庆",
      data: ["重庆"],
    },
  ],
  F: [
    {
      id: "F",
      name: "福建",
      data: ["福州"],
    },
  ],
  G: [
    {
      id: "G",
      name: "广东",
      data: ["广州"],
    },
    {
      name: "广西",
      data: ["南宁"],
    },
    {
      name: "贵州",
      data: ["贵阳"],
    },
  ],
  H: [
    {
      id: "H",
      name: "河北",
      data: ["石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口"],
    },
    {
      name: "河南",
      data: ["郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡"],
    },
    {
      name: "黑龙江",
      data: [
        "哈尔滨",
        "齐齐哈尔",
        "牡丹江",
        "佳木斯",
        "大庆",
        "鸡西",
        "双鸭山",
      ],
    },
    {
      name: "湖北",
      data: ["武汉", "黄石", "十堰", "宜昌", "襄阳", "鄂州", "荆门"],
    },
    {
      name: "湖南",
      data: ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德"],
    },
    {
      name: "海南",
      data: ["海口", "三亚", "三沙", "琼海", "文昌", "万宁", "陵水"],
    },
    {
      name: "陕西",
      data: ["西安"],
    },
  ],
  J: [
    {
      id: "J",
      name: "江苏",
      data: ["南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港"],
    },
    {
      name: "江西",
      data: ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州"],
    },
  ],
  L: [
    {
      id: "L",
      name: "辽宁",
      data: ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州"],
    },
  ],
  N: [
    {
      id: "N",
      name: "内蒙古",
      data: [
        "呼和浩特",
        "包头",
        "乌海",
        "赤峰",
        "通辽",
        "鄂尔多斯",
        "呼伦贝尔",
      ],
    },
    {
      name: "宁夏",
      data: ["银川", "石嘴山", "吴忠", "固原", "中卫"],
    },
  ],
  Q: [
    {
      id: "Q",
      name: "青海",
      data: ["西宁"],
    },
  ],
  S: [
    {
      id: "S",
      name: "山东",
      data: ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊"],
    },
    {
      name: "山西",
      data: ["太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中"],
    },
    {
      name: "四川",
      data: ["成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广安"],
    },
    {
      name: "上海",
      data: ["上海"],
    },
    {
      name: "陕西",
      data: ["西安"],
    },
    {
      name: "甘肃",
      data: ["兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖"],
    },
  ],
  X: [
    {
      id: "X",
      name: "西藏",
      data: ["拉萨", "日喀则", "昌都", "林芝", "山南", "那曲", "阿里"],
    },
  ],
  Y: [
    {
      id: "Y",
      name: "云南",
      data: ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱"],
    },
  ],
  Z: [
    {
      id: "Z",
      name: "浙江",
      data: ["杭州", "宁波", "温州", "嘉兴", "湖州市", "绍兴", "金华"],
    },
  ],
}
